[command]/home/runner/work/_temp/5ea779d1-0c7a-42e7-80b9-b1c3d2de87f5/terraform-bin plan -no-color -var-file=vars.tfvars
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

github_issue_label.github_feature: Refreshing state... [id=github:Feature]
github_repository_collaborator.github_tubone24: Refreshing state... [id=github:tubone24]
github_membership.membership_tubone24: Refreshing state... [id=89dojo:tubone24]
github_team.admin: Refreshing state... [id=4697422]
github_team.developer: Refreshing state... [id=4709164]
github_issue_label.github_bug: Refreshing state... [id=github:Bug]
github_repository.github: Refreshing state... [id=github]
github_team_membership.team_admin_tubone24: Refreshing state... [id=4697422:tubone24]
github_team_membership.team_developer_tubone24: Refreshing state... [id=4709164:tubone24]
github_team_repository.team_admin_github: Refreshing state... [id=4697422:github]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_organization_project.org_project will be created
  + resource "github_organization_project" "org_project" {
      + body = "89Dojo milestone"
      + etag = (known after apply)
      + id   = (known after apply)
      + name = "89Dojo milestone"
      + url  = (known after apply)
    }

  # github_project_column.Done will be created
  + resource "github_project_column" "Done" {
      + column_id  = (known after apply)
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "Done"
      + project_id = (known after apply)
    }

  # github_project_column.considering will be created
  + resource "github_project_column" "considering" {
      + column_id  = (known after apply)
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "Considering"
      + project_id = (known after apply)
    }

  # github_project_column.doing will be created
  + resource "github_project_column" "doing" {
      + column_id  = (known after apply)
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "Doing"
      + project_id = (known after apply)
    }

  # github_project_column.todo will be created
  + resource "github_project_column" "todo" {
      + column_id  = (known after apply)
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "ToDo"
      + project_id = (known after apply)
    }

  # github_project_column.wait_review will be created
  + resource "github_project_column" "wait_review" {
      + column_id  = (known after apply)
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "Wait review"
      + project_id = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Warning: "organization": [DEPRECATED] Use owner (or GITHUB_OWNER) instead of organization (or GITHUB_ORGANIZATION)



------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

::debug::Terraform exited with code 0.
::debug::stdout: Refreshing Terraform state in-memory prior to plan...%0AThe refreshed state will be used to calculate this plan, but will not be%0Apersisted to local or remote state storage.%0A%0Agithub_issue_label.github_feature: Refreshing state... [id=github:Feature]%0Agithub_repository_collaborator.github_tubone24: Refreshing state... [id=github:tubone24]%0Agithub_membership.membership_tubone24: Refreshing state... [id=89dojo:tubone24]%0Agithub_team.admin: Refreshing state... [id=4697422]%0Agithub_team.developer: Refreshing state... [id=4709164]%0Agithub_issue_label.github_bug: Refreshing state... [id=github:Bug]%0Agithub_repository.github: Refreshing state... [id=github]%0Agithub_team_membership.team_admin_tubone24: Refreshing state... [id=4697422:tubone24]%0Agithub_team_membership.team_developer_tubone24: Refreshing state... [id=4709164:tubone24]%0Agithub_team_repository.team_admin_github: Refreshing state... [id=4697422:github]%0A%0A------------------------------------------------------------------------%0A%0AAn execution plan has been generated and is shown below.%0AResource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # github_organization_project.org_project will be created%0A  + resource "github_organization_project" "org_project" {%0A      + body = "89Dojo milestone"%0A      + etag = (known after apply)%0A      + id   = (known after apply)%0A      + name = "89Dojo milestone"%0A      + url  = (known after apply)%0A    }%0A%0A  # github_project_column.Done will be created%0A  + resource "github_project_column" "Done" {%0A      + column_id  = (known after apply)%0A      + etag       = (known after apply)%0A      + id         = (known after apply)%0A      + name       = "Done"%0A      + project_id = (known after apply)%0A    }%0A%0A  # github_project_column.considering will be created%0A  + resource "github_project_column" "considering" {%0A      + column_id  = (known after apply)%0A      + etag       = (known after apply)%0A      + id         = (known after apply)%0A      + name       = "Considering"%0A      + project_id = (known after apply)%0A    }%0A%0A  # github_project_column.doing will be created%0A  + resource "github_project_column" "doing" {%0A      + column_id  = (known after apply)%0A      + etag       = (known after apply)%0A      + id         = (known after apply)%0A      + name       = "Doing"%0A      + project_id = (known after apply)%0A    }%0A%0A  # github_project_column.todo will be created%0A  + resource "github_project_column" "todo" {%0A      + column_id  = (known after apply)%0A      + etag       = (known after apply)%0A      + id         = (known after apply)%0A      + name       = "ToDo"%0A      + project_id = (known after apply)%0A    }%0A%0A  # github_project_column.wait_review will be created%0A  + resource "github_project_column" "wait_review" {%0A      + column_id  = (known after apply)%0A      + etag       = (known after apply)%0A      + id         = (known after apply)%0A      + name       = "Wait review"%0A      + project_id = (known after apply)%0A    }%0A%0APlan: 6 to add, 0 to change, 0 to destroy.%0A%0AWarning: "organization": [DEPRECATED] Use owner (or GITHUB_OWNER) instead of organization (or GITHUB_ORGANIZATION)%0A%0A%0A%0A------------------------------------------------------------------------%0A%0ANote: You didn't specify an "-out" parameter to save this plan, so Terraform%0Acan't guarantee that exactly these actions will be performed if%0A"terraform apply" is subsequently run.%0A%0A
::debug::stderr: 
::debug::exitcode: 0
::set-output name=stdout::Refreshing Terraform state in-memory prior to plan...%0AThe refreshed state will be used to calculate this plan, but will not be%0Apersisted to local or remote state storage.%0A%0Agithub_issue_label.github_feature: Refreshing state... [id=github:Feature]%0Agithub_repository_collaborator.github_tubone24: Refreshing state... [id=github:tubone24]%0Agithub_membership.membership_tubone24: Refreshing state... [id=89dojo:tubone24]%0Agithub_team.admin: Refreshing state... [id=4697422]%0Agithub_team.developer: Refreshing state... [id=4709164]%0Agithub_issue_label.github_bug: Refreshing state... [id=github:Bug]%0Agithub_repository.github: Refreshing state... [id=github]%0Agithub_team_membership.team_admin_tubone24: Refreshing state... [id=4697422:tubone24]%0Agithub_team_membership.team_developer_tubone24: Refreshing state... [id=4709164:tubone24]%0Agithub_team_repository.team_admin_github: Refreshing state... [id=4697422:github]%0A%0A------------------------------------------------------------------------%0A%0AAn execution plan has been generated and is shown below.%0AResource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # github_organization_project.org_project will be created%0A  + resource "github_organization_project" "org_project" {%0A      + body = "89Dojo milestone"%0A      + etag = (known after apply)%0A      + id   = (known after apply)%0A      + name = "89Dojo milestone"%0A      + url  = (known after apply)%0A    }%0A%0A  # github_project_column.Done will be created%0A  + resource "github_project_column" "Done" {%0A      + column_id  = (known after apply)%0A      + etag       = (known after apply)%0A      + id         = (known after apply)%0A      + name       = "Done"%0A      + project_id = (known after apply)%0A    }%0A%0A  # github_project_column.considering will be created%0A  + resource "github_project_column" "considering" {%0A      + column_id  = (known after apply)%0A      + etag       = (known after apply)%0A      + id         = (known after apply)%0A      + name       = "Considering"%0A      + project_id = (known after apply)%0A    }%0A%0A  # github_project_column.doing will be created%0A  + resource "github_project_column" "doing" {%0A      + column_id  = (known after apply)%0A      + etag       = (known after apply)%0A      + id         = (known after apply)%0A      + name       = "Doing"%0A      + project_id = (known after apply)%0A    }%0A%0A  # github_project_column.todo will be created%0A  + resource "github_project_column" "todo" {%0A      + column_id  = (known after apply)%0A      + etag       = (known after apply)%0A      + id         = (known after apply)%0A      + name       = "ToDo"%0A      + project_id = (known after apply)%0A    }%0A%0A  # github_project_column.wait_review will be created%0A  + resource "github_project_column" "wait_review" {%0A      + column_id  = (known after apply)%0A      + etag       = (known after apply)%0A      + id         = (known after apply)%0A      + name       = "Wait review"%0A      + project_id = (known after apply)%0A    }%0A%0APlan: 6 to add, 0 to change, 0 to destroy.%0A%0AWarning: "organization": [DEPRECATED] Use owner (or GITHUB_OWNER) instead of organization (or GITHUB_ORGANIZATION)%0A%0A%0A%0A------------------------------------------------------------------------%0A%0ANote: You didn't specify an "-out" parameter to save this plan, so Terraform%0Acan't guarantee that exactly these actions will be performed if%0A"terraform apply" is subsequently run.%0A%0A
::set-output name=stderr::
::set-output name=exitcode::0
